#include <iostream>

int main()
{
    std::cout << " ██████╗  █████╗ ██╗      █████╗  ██████╗  █████╗ " << std::endl;
    std::cout << "██╔════╝ ██╔══██╗██║     ██╔══██╗██╔════╝ ██╔══██╗" << std::endl;
    std::cout << "██║  ███╗███████║██║     ███████║██║  ███╗███████║" << std::endl;
    std::cout << "██║   ██║██╔══██║██║     ██╔══██║██║   ██║██╔══██║" << std::endl;
    std::cout << "╚██████╔╝██║  ██║███████╗██║  ██║╚██████╔╝██║  ██║" << std::endl;
    std::cout << " ╚═════╝ ╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝ ╚═════╝ ╚═╝  ╚═╝ " << std::endl;

    std::cout << std::endl
              << std::endl;

    std::cout << "Добро пожаловать в text-galaga!" << std::endl;
    std::cout << "_________________________" << std::endl;
    std::cout << "Используйте W для движения вперёд," << std::endl;
    std::cout << "A для движения влево, S для движения назад," << std::endl;
    std::cout << "D для движения вправо и J для стрельбы" << std::endl;
    std::cout << "_________________________" << std::endl;

    std::cout << "Удачи!" << std::endl
              << std::endl;

    return 0;
}
